keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEbu_bf.h
/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.WAIT */
#define IFX_EBU_BUSRCON_WAIT_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.WAIT */
#define IFX_EBU_BUSRCON_WAIT_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.WAIT */
#define IFX_EBU_BUSRCON_WAIT_OFF (24)

/** \\brief  Length for Ifx_EBU_BUSRCON_Bits.WAITINV */
#define IFX_EBU_BUSRCON_WAITINV_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSRCON_Bits.WAITINV */
#define IFX_EBU_BUSRCON_WAITINV_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSRCON_Bits.WAITINV */
#define IFX_EBU_BUSRCON_WAITINV_OFF (19)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.ADDRC */
#define IFX_EBU_BUSWAP_ADDRC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.ADDRC */
#define IFX_EBU_BUSWAP_ADDRC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.ADDRC */
#define IFX_EBU_BUSWAP_ADDRC_OFF (28)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.AHOLDC */
#define IFX_EBU_BUSWAP_AHOLDC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.AHOLDC */
#define IFX_EBU_BUSWAP_AHOLDC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.AHOLDC */
#define IFX_EBU_BUSWAP_AHOLDC_OFF (24)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.CMDDELAY */
#define IFX_EBU_BUSWAP_CMDDELAY_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.CMDDELAY */
#define IFX_EBU_BUSWAP_CMDDELAY_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.CMDDELAY */
#define IFX_EBU_BUSWAP_CMDDELAY_OFF (20)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.DATAC */
#define IFX_EBU_BUSWAP_DATAC_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.DATAC */
#define IFX_EBU_BUSWAP_DATAC_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.DATAC */
#define IFX_EBU_BUSWAP_DATAC_OFF (12)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSWAP_EXTCLOCK_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSWAP_EXTCLOCK_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.EXTCLOCK */
#define IFX_EBU_BUSWAP_EXTCLOCK_OFF (16)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.EXTDATA */
#define IFX_EBU_BUSWAP_EXTDATA_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.EXTDATA */
#define IFX_EBU_BUSWAP_EXTDATA_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.EXTDATA */
#define IFX_EBU_BUSWAP_EXTDATA_OFF (18)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.WAITWRC */
#define IFX_EBU_BUSWAP_WAITWRC_LEN (5)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.WAITWRC */
#define IFX_EBU_BUSWAP_WAITWRC_MSK (0x1f)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.WAITWRC */
#define IFX_EBU_BUSWAP_WAITWRC_OFF (7)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.WRDTACS */
#define IFX_EBU_BUSWAP_WRDTACS_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.WRDTACS */
#define IFX_EBU_BUSWAP_WRDTACS_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.WRDTACS */
#define IFX_EBU_BUSWAP_WRDTACS_OFF (0)

/** \\brief  Length for Ifx_EBU_BUSWAP_Bits.WRRECOVC */
#define IFX_EBU_BUSWAP_WRRECOVC_LEN (3)

/** \\brief  Mask for Ifx_EBU_BUSWAP_Bits.WRRECOVC */
#define IFX_EBU_BUSWAP_WRRECOVC_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_BUSWAP_Bits.WRRECOVC */
#define IFX_EBU_BUSWAP_WRRECOVC_OFF (4)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.AAP */
#define IFX_EBU_BUSWCON_AAP_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.AAP */
#define IFX_EBU_BUSWCON_AAP_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.AAP */
#define IFX_EBU_BUSWCON_AAP_OFF (26)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.AGEN */
#define IFX_EBU_BUSWCON_AGEN_LEN (4)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.AGEN */
#define IFX_EBU_BUSWCON_AGEN_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.AGEN */
#define IFX_EBU_BUSWCON_AGEN_OFF (28)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.BCGEN */
#define IFX_EBU_BUSWCON_BCGEN_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.BCGEN */
#define IFX_EBU_BUSWCON_BCGEN_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.BCGEN */
#define IFX_EBU_BUSWCON_BCGEN_OFF (20)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.EBSE */
#define IFX_EBU_BUSWCON_EBSE_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.EBSE */
#define IFX_EBU_BUSWCON_EBSE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.EBSE */
#define IFX_EBU_BUSWCON_EBSE_OFF (17)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.ECSE */
#define IFX_EBU_BUSWCON_ECSE_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.ECSE */
#define IFX_EBU_BUSWCON_ECSE_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.ECSE */
#define IFX_EBU_BUSWCON_ECSE_OFF (16)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.FBBMSEL */
#define IFX_EBU_BUSWCON_FBBMSEL_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.FBBMSEL */
#define IFX_EBU_BUSWCON_FBBMSEL_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.FBBMSEL */
#define IFX_EBU_BUSWCON_FBBMSEL_OFF (3)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.FETBLEN */
#define IFX_EBU_BUSWCON_FETBLEN_LEN (3)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.FETBLEN */
#define IFX_EBU_BUSWCON_FETBLEN_MSK (0x7)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.FETBLEN */
#define IFX_EBU_BUSWCON_FETBLEN_OFF (0)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.LOCKCS */
#define IFX_EBU_BUSWCON_LOCKCS_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.LOCKCS */
#define IFX_EBU_BUSWCON_LOCKCS_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.LOCKCS */
#define IFX_EBU_BUSWCON_LOCKCS_OFF (27)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.NAA */
#define IFX_EBU_BUSWCON_NAA_LEN (1)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.NAA */
#define IFX_EBU_BUSWCON_NAA_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_BUSWCON_Bits.NAA */
#define IFX_EBU_BUSWCON_NAA_OFF (7)

/** \\brief  Length for Ifx_EBU_BUSWCON_Bits.PORTW */
#define IFX_EBU_BUSWCON_PORTW_LEN (2)

/** \\brief  Mask for Ifx_EBU_BUSWCON_Bits.PORTW */
#define IFX_EBU_BUSWCON_PORTW_MSK (0x3)

