keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEbu_bf.h
/** \\brief  Mask for Ifx_EBU_SDR_STAT_Bits.SDRMBUSY */
#define IFX_EBU_SDR_STAT_SDRMBUSY_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_SDR_STAT_Bits.SDRMBUSY */
#define IFX_EBU_SDR_STAT_SDRMBUSY_OFF (1)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_LEN (4)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_MSK (0xf)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_OFF (16)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_OFF (31)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_OFF (30)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_LEN (1)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_MSK (0x1)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_OFF (0)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_LEN (7)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_MSK (0x7f)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_OFF (1)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_LEN (8)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_MSK (0xff)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.RES1 */
#define IFX_EBU_USERCON_RES1_OFF (8)

/** \\brief  Length for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_LEN (2)

/** \\brief  Mask for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_MSK (0x3)

/** \\brief  Offset for Ifx_EBU_USERCON_Bits.RES */
#define IFX_EBU_USERCON_RES_OFF (28)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBU_BF_H */
